tutorials/icoTopoFoam/mixer2D/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "";
    case "";
    instance "";
    local "";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
impellerWall
{
    type wall;
    physicalType movingWall;
    nFaces 68;
    startFace 1040;
}

baffleWall
{
    type wall;
    physicalType wall;
    nFaces 84;
    startFace 1108;
}

insideSlider
{
    type patch;
    physicalType movingWall;
    nFaces 36;
    startFace 1192;
}

outsideSlider
{
    type patch;
    physicalType movingWall;
    nFaces 36;
    startFace 1228;
}

defaultFaces
{
    type empty;
    nFaces 1152;
    startFace 1264;
}
)

// ************************************************************************* //
